In [126]:
import pandas as pd
import csv

Import absolute file path

In [127]:
import os

employee_path = os.path.abspath("../data/Employee_Data.csv")

This Python code uses the pandas library to read in data from a CSV file located at the path specified by the employee_path variable. The data is stored in a pandas DataFrame object called employee_df.

Here is an explanation of the parameters used in the pd.read_csv() function:

- filepath_or_buffer: This is the path to the CSV file or a buffer that contains the CSV data. In this case, the path is specified by the employee_path variable.
- header: This parameter specifies which row of the CSV file contains the column names. A value of 0 means that the first row contains the column names. If there is no header row in the file, you can set this to None.
- sep: This parameter specifies the delimiter used in the CSV file. In this case, the delimiter is a pipe character '|'.
- quoting: This parameter specifies how quotes are handled in the CSV file. In this case, csv.QUOTE_NONE is used, which means that quotes are not used to quote fields.

Overall, this code reads in a CSV file using pandas and creates a DataFrame object that can be used for data analysis and manipulation.

In [132]:
employee_df = pd.read_csv(filepath_or_buffer=employee_path, header=0, sep='|', quoting=csv.QUOTE_NONE)
display(employee_df)

   Employee ID           Full Name                    Email
0    "0002234"            "Jo Ann"  "jda07c@university.edu"
1    "0002235"         "Sally May"  "swm04d@university.edu"
2    "0002236"          "Ell Myra"  "elm09e@university.edu"
3    "0002237"          "John Doe"  "jad05f@university.edu"
4    "0002238"         "Sam Stone"  "sss02g@university.edu"
5    "0002239"      "Thomas Potts"  "tlp01h@university.edu"
6    "0002398"     "Andrew Cotton"  "abc03i@university.edu"
7    "0002399"       "David Friar"  "def04j@university.edu"
8    "0002400"        "George Ice"  "ghi05k@university.edu"
9    "0002407"        "James Admin                       ""
10   "0002410"     "James Landers"  "jkl06l@university.edu"
11   "0002411"        "Mary Olive"  "mno07m@university.edu"
12   "0002420"        "Paul Roger"  "pqr08n@university.edu"
13   "0002421"       "Sue Underly"  "stu09o@university.edu"
14   "0002422"  "Victoria Xanadoo"  "vwx00p@university.edu"
15   "0002423"    "Roger Gonzalez"  "rbg03x@univeristy.edu"

The first line of this Python code renames the columns of a pandas DataFrame object employee_df by replacing any spaces in the column names with underscores. The updated column names are then assigned back to the employee_df.columns attribute.

Here is an explanation of the code:

- employee_df.columns: This attribute of a pandas DataFrame object contains the column names of the DataFrame.
- employee_df.columns.str.replace(' ', '_'): This line of code uses the str.replace() method to replace any spaces in the column names with underscores. The str attribute allows us to apply a string method to all the column names at once.
- employee_df.columns = employee_df.columns.str.replace(' ', '_'): This line assigns the updated column names back to the employee_df.columns attribute.
The second line of the code uses the display() function to display the updated DataFrame employee_df with the new column names.

Overall, this code updates the column names of a pandas DataFrame by replacing spaces with underscores, which can make the column names easier to work with in data analysis and visualization. The display() function is used to show the updated DataFrame.

In [133]:
employee_df.columns = employee_df.columns.str.replace(' ', '_')
display(employee_df)

   Employee_ID           Full_Name                    Email
0    "0002234"            "Jo Ann"  "jda07c@university.edu"
1    "0002235"         "Sally May"  "swm04d@university.edu"
2    "0002236"          "Ell Myra"  "elm09e@university.edu"
3    "0002237"          "John Doe"  "jad05f@university.edu"
4    "0002238"         "Sam Stone"  "sss02g@university.edu"
5    "0002239"      "Thomas Potts"  "tlp01h@university.edu"
6    "0002398"     "Andrew Cotton"  "abc03i@university.edu"
7    "0002399"       "David Friar"  "def04j@university.edu"
8    "0002400"        "George Ice"  "ghi05k@university.edu"
9    "0002407"        "James Admin                       ""
10   "0002410"     "James Landers"  "jkl06l@university.edu"
11   "0002411"        "Mary Olive"  "mno07m@university.edu"
12   "0002420"        "Paul Roger"  "pqr08n@university.edu"
13   "0002421"       "Sue Underly"  "stu09o@university.edu"
14   "0002422"  "Victoria Xanadoo"  "vwx00p@university.edu"
15   "0002423"    "Roger Gonzalez"  "rbg03x@univeristy.edu"

The Python code above uses pandas DataFrame's apply() function to remove double quotes from all values in the DataFrame employee_df. The updated DataFrame is then assigned to a new variable called remove_quotes. The lambda function is used to apply the str.replace() method to all string values in each column of the DataFrame.

Here is an explanation of the code:

- employee_df.apply(lambda s:s.str.replace('"', "")): This code applies the lambda function to each column of the DataFrame employee_df using the apply() function. The lambda function takes a series s as input and applies the str.replace() method to replace any double quotes with an empty string.
- remove_quotes: This variable stores the updated DataFrame with all double quotes removed from the original employee_df.
- display(remove_quotes): This code displays the updated DataFrame remove_quotes using the display() function.

Overall, this code removes all double quotes from the DataFrame employee_df, which can be useful for data cleaning or preparing data for further analysis. The updated DataFrame is then displayed using the display() function.

In [137]:
employee_clean_data_df = employee_df.apply(lambda s:s.str.replace('"', ""))
display(employee_clean_data_df)

   Employee_ID         Full_Name                  Email
0      0002234            Jo Ann  jda07c@university.edu
1      0002235         Sally May  swm04d@university.edu
2      0002236          Ell Myra  elm09e@university.edu
3      0002237          John Doe  jad05f@university.edu
4      0002238         Sam Stone  sss02g@university.edu
5      0002239      Thomas Potts  tlp01h@university.edu
6      0002398     Andrew Cotton  abc03i@university.edu
7      0002399       David Friar  def04j@university.edu
8      0002400        George Ice  ghi05k@university.edu
9      0002407       James Admin
10     0002410     James Landers  jkl06l@university.edu
11     0002411        Mary Olive  mno07m@university.edu
12     0002420        Paul Roger  pqr08n@university.edu
13     0002421       Sue Underly  stu09o@university.edu
14     0002422  Victoria Xanadoo  vwx00p@university.edu
15     0002423    Roger Gonzalez  rbg03x@univeristy.edu

1. Install MySQL server from: https://dev.mysql.com/doc/refman/8.0/en/windows-installation.html
2. During installation set your user as **root** and password as **root_is_cool**
3. Install MySQL workbench/editor from: https://www.mysql.com/products/workbench/ or alternatively yo can use PyCharm to connect to MySQL server.
![alt text](https://github.com/arturogonzalezm/students/blob/main/images/mysql_pycharm.png)
4. Open your MySQL workbench Create DB/Schema called **students** in your query editor by typing:
```CREATE DATABASE IF NOT EXISTS students```
5. Create a script that calls the **employee_clean_data_df** DataFrame, creates a table and inserts the data give the following connection string:
```mysql+mysqlconnector://[user]:[pass]@[host]:[port]/[schema]```

In [138]:
from sqlalchemy import create_engine

In [139]:
engine = create_engine('mysql+mysqlconnector://root:root_is_cool@localhost:3306/students', echo=False)
employee_clean_data_df.to_sql(name='employees', con=engine, if_exists = 'replace', index=False)

Check that the data has been inserted by typying on PyCharm MySQL editor or MySQL Workbench:

```
USE students;
SELECT * FROM employees;
```

Or you can check that the data has been inserted into MySQL from Python too by typing:

In [141]:
query_employees_df = pd.read_sql_query('''SELECT * FROM employees''', con=engine)
display(query_employees_df)

   Employee_ID         Full_Name                  Email
0      0002234            Jo Ann  jda07c@university.edu
1      0002235         Sally May  swm04d@university.edu
2      0002236          Ell Myra  elm09e@university.edu
3      0002237          John Doe  jad05f@university.edu
4      0002238         Sam Stone  sss02g@university.edu
5      0002239      Thomas Potts  tlp01h@university.edu
6      0002398     Andrew Cotton  abc03i@university.edu
7      0002399       David Friar  def04j@university.edu
8      0002400        George Ice  ghi05k@university.edu
9      0002407       James Admin
10     0002410     James Landers  jkl06l@university.edu
11     0002411        Mary Olive  mno07m@university.edu
12     0002420        Paul Roger  pqr08n@university.edu
13     0002421       Sue Underly  stu09o@university.edu
14     0002422  Victoria Xanadoo  vwx00p@university.edu
15     0002423    Roger Gonzalez  rbg03x@univeristy.edu